In [2]:
import os
import json
import sys
import numpy as np
import pandas as pd
import sqlalchemy as sa

In [36]:
# load database credentials and change database to "datalabeling"
db_creds = json.load(open(f"/home/{os.environ['USER']}/.arc_config/databases/sqlserver-2-3306.txt"))
connection_uri = '/'.join( db_creds['default_uri'].split('/')[:3] + ['datalabeling'])

# create connection
conn = sa.engine.create_engine(connection_uri)

# test if connection works
q = """
SELECT NOW() AS jetzt
"""
display(pd.read_sql(q, conn))

                jetzt
0 2021-03-27 15:54:02

In [10]:
x

dict_keys(['user', 'password', 'host', 'port', 'default_db', 'default_uri'])

In [22]:
connection_uri = '/'.join( db_creds['default_uri'].split('/')[:3] + ['datalabeling'])

In [24]:
q = """
SELECT NOW() AS now
"""
pd.read_sql(q, conn)

                  now
0 2021-03-27 15:45:30

In [34]:
q = """
SHOW TABLES
"""
pd.read_sql(q, conn)

Empty DataFrame
Columns: [Tables_in_datalabeling]
Index: []

In [32]:
q = """
DESCRIBE probier
"""
pd.read_sql(q, conn)

    Field        Type Null  Key Default Extra
0  row_id  bigint(20)  YES  MUL    None
1   first  bigint(20)  YES         None
2  second  bigint(20)  YES         None
3   third  bigint(20)  YES         None

In [33]:
conn.execute("""DROP TABLE probier""")

In [28]:
df = pd.DataFrame(np.random.randint(1000, 9999, (100,3)), columns=['first', 'second', 'third'])
df.head()

   first  second  third
0   9384    4464   3123
1   7199    3638   8675
2   2808    4581   6952
3   7315    3467   1779
4   7955    6261   4978

In [29]:
df.to_sql('probier', index_label='row_id', con=conn)